{
    "buckets": [
        {
            "Name": "main",
            "Source": "https://github.com/ScoopInstaller/Main",
            "Updated": "2024-08-26T16:29:51+08:00",
            "Manifests": 1339
        },
        {
            "Name": "extras",
            "Source": "https://github.com/ScoopInstaller/Extras",
            "Updated": "2024-08-26T16:32:43+08:00",
            "Manifests": 2060
        },
        {
            "Name": "versions",
            "Source": "https://github.com/ScoopInstaller/Versions",
            "Updated": "2024-08-26T16:37:17+08:00",
            "Manifests": 469
        },
        {
            "Name": "nerd-fonts",
            "Source": "https://github.com/matthewjberger/scoop-nerd-fonts",
            "Updated": "2024-08-25T06:19:17+08:00",
            "Manifests": 336
        },
        {
            "Name": "nonportable",
            "Source": "https://github.com/ScoopInstaller/Nonportable",
            "Updated": "2024-08-23T12:34:52+08:00",
            "Manifests": 127
        },
        {
            "Name": "java",
            "Source": "https://github.com/ScoopInstaller/Java",
            "Updated": "2024-08-25T09:17:46+08:00",
            "Manifests": 285
        },
        {
            "Name": "wsw0108",
            "Source": "https://github.com/wsw0108/scoop-bucket.git",
            "Updated": "2024-03-28T18:18:45+08:00",
            "Manifests": 11
        }
    ],
    "apps": [
        {
            "Name": "7zip",
            "Source": "main",
            "Updated": "2024-08-24T18:22:04.131147+08:00",
            "Info": "",
            "Version": "24.08"
        },
        {
            "Name": "aria2",
            "Source": "main",
            "Updated": "2024-08-24T18:28:07.0465843+08:00",
            "Info": "",
            "Version": "1.37.0-1"
        },
        {
            "Name": "binutils",
            "Source": "main",
            "Updated": "2024-08-24T18:28:36.7549754+08:00",
            "Info": "",
            "Version": "2.43"
        },
        {
            "Name": "bun",
            "Source": "main",
            "Updated": "2024-08-24T18:28:53.1710774+08:00",
            "Info": "",
            "Version": "1.1.26"
        },
        {
            "Name": "cacert",
            "Source": "main",
            "Updated": "2024-08-24T18:23:23.4324087+08:00",
            "Info": "",
            "Version": "2024-07-02"
        },
        {
            "Name": "calibre",
            "Source": "extras",
            "Updated": "2024-08-24T18:29:49.3823251+08:00",
            "Info": "",
            "Version": "7.17.0"
        },
        {
            "Name": "clangd",
            "Source": "main",
            "Updated": "2024-08-24T18:29:56.2691166+08:00",
            "Info": "",
            "Version": "18.1.3"
        },
        {
            "Name": "clion",
            "Source": "extras",
            "Updated": "2024-08-25T09:09:09.9496632+08:00",
            "Info": "",
            "Version": "2024.2-242.20224.384"
        },
        {
            "Name": "cmake",
            "Source": "main",
            "Updated": "2024-08-24T18:30:54.5642194+08:00",
            "Info": "",
            "Version": "3.30.2"
        },
        {
            "Name": "curl",
            "Source": "main",
            "Updated": "2024-08-25T09:30:12.0993428+08:00",
            "Info": "",
            "Version": "8.9.1_2"
        },
        {
            "Name": "dark",
            "Source": "main",
            "Updated": "2024-08-24T18:31:43.301826+08:00",
            "Info": "",
            "Version": "3.14"
        },
        {
            "Name": "dbeaver",
            "Source": "extras",
            "Updated": "2024-08-24T19:38:05.8393693+08:00",
            "Info": "",
            "Version": "24.1.5"
        },
        {
            "Name": "delta",
            "Source": "main",
            "Updated": "2024-08-25T09:30:16.3314249+08:00",
            "Info": "",
            "Version": "0.18.1"
        },
        {
            "Name": "diffutils",
            "Source": "main",
            "Updated": "2024-08-24T18:36:52.6398211+08:00",
            "Info": "",
            "Version": "3.6"
        },
        {
            "Name": "discord",
            "Source": "extras",
            "Updated": "2024-08-24T18:37:08.9784639+08:00",
            "Info": "",
            "Version": "1.0.9035-18"
        },
        {
            "Name": "draw.io",
            "Source": "extras",
            "Updated": "2024-08-24T18:37:40.343836+08:00",
            "Info": "",
            "Version": "24.7.5"
        },
        {
            "Name": "emacs",
            "Source": "extras",
            "Updated": "2024-08-24T18:40:00.6268594+08:00",
            "Info": "",
            "Version": "29.4"
        },
        {
            "Name": "fastfetch",
            "Source": "main",
            "Updated": "2024-08-26T19:43:05.9370257+08:00",
            "Info": "",
            "Version": "2.22.0"
        },
        {
            "Name": "fd",
            "Source": "main",
            "Updated": "2024-08-24T18:40:31.2093759+08:00",
            "Info": "",
            "Version": "10.2.0"
        },
        {
            "Name": "FiraCode-NF-Mono",
            "Source": "nerd-fonts",
            "Updated": "2024-08-24T18:40:37.7595564+08:00",
            "Info": "",
            "Version": "3.2.1"
        },
        {
            "Name": "firefox",
            "Source": "extras",
            "Updated": "2024-08-24T18:40:52.0028387+08:00",
            "Info": "",
            "Version": "129.0.2"
        },
        {
            "Name": "fzf",
            "Source": "main",
            "Updated": "2024-08-24T18:41:06.7553448+08:00",
            "Info": "",
            "Version": "0.54.3"
        },
        {
            "Name": "gcc",
            "Source": "main",
            "Updated": "2024-08-24T18:41:29.3914716+08:00",
            "Info": "",
            "Version": "13.2.0"
        },
        {
            "Name": "gdb",
            "Source": "main",
            "Updated": "2024-08-24T19:38:22.0040088+08:00",
            "Info": "",
            "Version": "14.1"
        },
        {
            "Name": "geekuninstaller",
            "Source": "extras",
            "Updated": "2024-08-24T19:38:23.5450443+08:00",
            "Info": "",
            "Version": "1.5.2.165"
        },
        {
            "Name": "gh",
            "Source": "main",
            "Updated": "2024-08-24T19:38:26.8202463+08:00",
            "Info": "",
            "Version": "2.55.0"
        },
        {
            "Name": "ghostscript",
            "Source": "main",
            "Updated": "2024-08-26T08:59:58.091772+08:00",
            "Info": "",
            "Version": "10.03.1"
        },
        {
            "Name": "git",
            "Source": "main",
            "Updated": "2024-08-24T18:22:22.0847553+08:00",
            "Info": "",
            "Version": "2.46.0"
        },
        {
            "Name": "gnuplot",
            "Source": "main",
            "Updated": "2024-08-24T19:39:10.6628595+08:00",
            "Info": "",
            "Version": "6.0.1"
        },
        {
            "Name": "go",
            "Source": "main",
            "Updated": "2024-08-24T19:39:46.6575701+08:00",
            "Info": "",
            "Version": "1.23.0"
        },
        {
            "Name": "goland",
            "Source": "extras",
            "Updated": "2024-08-25T00:26:23.42201+08:00",
            "Info": "",
            "Version": "2024.2-242.20224.306"
        },
        {
            "Name": "gzip",
            "Source": "main",
            "Updated": "2024-08-24T19:39:53.1891473+08:00",
            "Info": "",
            "Version": "1.3.12"
        },
        {
            "Name": "hugo",
            "Source": "main",
            "Updated": "2024-08-24T19:39:59.3403685+08:00",
            "Info": "",
            "Version": "0.133.0"
        },
        {
            "Name": "imagemagick",
            "Source": "main",
            "Updated": "2024-08-26T08:59:14.4860385+08:00",
            "Info": "",
            "Version": "7.1.1-37"
        },
        {
            "Name": "innounp",
            "Source": "main",
            "Updated": "2024-08-24T19:40:00.7978394+08:00",
            "Info": "",
            "Version": "0.50"
        },
        {
            "Name": "kdenlive",
            "Source": "extras",
            "Updated": "2024-08-24T19:41:30.2486506+08:00",
            "Info": "",
            "Version": "24.05.2"
        },
        {
            "Name": "latex",
            "Source": "main",
            "Updated": "2024-08-24T19:45:40.7034541+08:00",
            "Info": "",
            "Version": "24.1"
        },
        {
            "Name": "lazygit",
            "Source": "extras",
            "Updated": "2024-08-24T19:45:45.0994404+08:00",
            "Info": "",
            "Version": "0.43.1"
        },
        {
            "Name": "librime",
            "Source": "wsw0108",
            "Updated": "2024-08-24T19:46:07.3929728+08:00",
            "Info": "",
            "Version": "1.8.5-1"
        },
        {
            "Name": "luajit",
            "Source": "main",
            "Updated": "2024-08-24T19:46:10.5279168+08:00",
            "Info": "",
            "Version": "2.1.1724174039-1"
        },
        {
            "Name": "LXGWWenKai",
            "Source": "nerd-fonts",
            "Updated": "2024-08-24T19:46:51.305603+08:00",
            "Info": "",
            "Version": "1.330"
        },
        {
            "Name": "LXGWWenKaiMono",
            "Source": "nerd-fonts",
            "Updated": "2024-08-24T20:23:44.028425+08:00",
            "Info": "",
            "Version": "1.330"
        },
        {
            "Name": "LXGWWenKaiScreenR",
            "Source": "nerd-fonts",
            "Updated": "2024-08-24T20:23:52.4023261+08:00",
            "Info": "",
            "Version": "1.315"
        },
        {
            "Name": "make",
            "Source": "main",
            "Updated": "2024-08-24T20:24:20.8194035+08:00",
            "Info": "",
            "Version": "4.4.1"
        },
        {
            "Name": "Maple-Mono",
            "Source": "nerd-fonts",
            "Updated": "2024-08-25T00:08:24.9567314+08:00",
            "Info": "",
            "Version": "6.4"
        },
        {
            "Name": "Maple-Mono-autohint",
            "Source": "nerd-fonts",
            "Updated": "2024-08-25T00:07:56.3014765+08:00",
            "Info": "",
            "Version": "6.4"
        },
        {
            "Name": "Maple-Mono-NF",
            "Source": "nerd-fonts",
            "Updated": "2024-08-25T00:07:28.260858+08:00",
            "Info": "",
            "Version": "6.4"
        },
        {
            "Name": "Maple-Mono-otf",
            "Source": "nerd-fonts",
            "Updated": "2024-08-25T00:07:21.6668709+08:00",
            "Info": "",
            "Version": "6.4"
        },
        {
            "Name": "Maple-Mono-SC-NF",
            "Source": "nerd-fonts",
            "Updated": "2024-08-24T20:24:31.3092951+08:00",
            "Info": "",
            "Version": "6.4"
        },
        {
            "Name": "miktex",
            "Source": "main",
            "Updated": "2024-08-24T20:25:27.7047992+08:00",
            "Info": "",
            "Version": "24.1"
        },
        {
            "Name": "Monaspace-NF-Mono",
            "Source": "nerd-fonts",
            "Updated": "2024-08-24T20:26:41.6122283+08:00",
            "Info": "",
            "Version": "3.2.1"
        },
        {
            "Name": "musicplayer2",
            "Source": "extras",
            "Updated": "2024-08-24T20:26:54.0820035+08:00",
            "Info": "",
            "Version": "2.77.1"
        },
        {
            "Name": "neovide",
            "Source": "extras",
            "Updated": "2024-08-24T20:27:05.5903274+08:00",
            "Info": "",
            "Version": "0.13.3"
        },
        {
            "Name": "neovim",
            "Source": "main",
            "Updated": "2024-08-24T20:27:11.4072843+08:00",
            "Info": "",
            "Version": "0.10.1"
        },
        {
            "Name": "ninja",
            "Source": "main",
            "Updated": "2024-08-24T20:27:13.191044+08:00",
            "Info": "",
            "Version": "1.12.1"
        },
        {
            "Name": "nodejs",
            "Source": "main",
            "Updated": "2024-08-24T20:27:21.5623582+08:00",
            "Info": "",
            "Version": "22.7.0"
        },
        {
            "Name": "obs-studio",
            "Source": "extras",
            "Updated": "2024-08-24T20:27:46.8355178+08:00",
            "Info": "",
            "Version": "30.2.3"
        },
        {
            "Name": "Office-Code-Pro",
            "Source": "nerd-fonts",
            "Updated": "2024-08-24T20:27:51.9147413+08:00",
            "Info": "",
            "Version": "1.004"
        },
        {
            "Name": "okular",
            "Source": "extras",
            "Updated": "2024-08-24T20:28:26.7009453+08:00",
            "Info": "",
            "Version": "24.08-5248"
        },
        {
            "Name": "oraclejdk",
            "Source": "java",
            "Updated": "2024-08-24T20:29:04.695478+08:00",
            "Info": "",
            "Version": "22.0.2"
        },
        {
            "Name": "pnpm",
            "Source": "main",
            "Updated": "2024-08-24T20:29:17.7100525+08:00",
            "Info": "",
            "Version": "9.8.0"
        },
        {
            "Name": "powertoys",
            "Source": "extras",
            "Updated": "2024-08-24T20:30:06.9862562+08:00",
            "Info": "",
            "Version": "0.83.0"
        },
        {
            "Name": "pycharm",
            "Source": "extras",
            "Updated": "2024-08-25T09:11:18.1733319+08:00",
            "Info": "",
            "Version": "2024.2-242.20224.347"
        },
        {
            "Name": "python",
            "Source": "main",
            "Updated": "2024-08-24T20:30:43.8333337+08:00",
            "Info": "",
            "Version": "3.12.5"
        },
        {
            "Name": "qbittorrent-enhanced",
            "Source": "extras",
            "Updated": "2024-08-25T09:30:27.1594711+08:00",
            "Info": "",
            "Version": "4.6.6.10"
        },
        {
            "Name": "ripgrep",
            "Source": "main",
            "Updated": "2024-08-24T20:30:56.4371239+08:00",
            "Info": "",
            "Version": "14.1.0"
        },
        {
            "Name": "rustup",
            "Source": "main",
            "Updated": "2024-08-24T20:31:34.1474983+08:00",
            "Info": "",
            "Version": "1.27.1"
        },
        {
            "Name": "Source-Han-Serif-SC",
            "Source": "nerd-fonts",
            "Updated": "2024-08-24T20:32:00.3325985+08:00",
            "Info": "",
            "Version": "2.003"
        },
        {
            "Name": "sqlite",
            "Source": "main",
            "Updated": "2024-08-24T20:32:04.6865507+08:00",
            "Info": "",
            "Version": "3.46.1"
        },
        {
            "Name": "starship",
            "Source": "main",
            "Updated": "2024-08-24T20:32:08.1324935+08:00",
            "Info": "",
            "Version": "1.20.1"
        },
        {
            "Name": "sublime-merge",
            "Source": "extras",
            "Updated": "2024-08-24T20:32:18.5318475+08:00",
            "Info": "",
            "Version": "2096"
        },
        {
            "Name": "sublime-text",
            "Source": "extras",
            "Updated": "2024-08-24T20:32:24.188085+08:00",
            "Info": "",
            "Version": "4-4180"
        },
        {
            "Name": "sumatrapdf",
            "Source": "extras",
            "Updated": "2024-08-24T23:36:33.5715482+08:00",
            "Info": "",
            "Version": "3.5.2"
        },
        {
            "Name": "telegram",
            "Source": "extras",
            "Updated": "2024-08-24T20:32:57.6378265+08:00",
            "Info": "",
            "Version": "5.4.1"
        },
        {
            "Name": "thunderbird",
            "Source": "extras",
            "Updated": "2024-08-24T20:33:08.7716863+08:00",
            "Info": "",
            "Version": "115.14.0"
        },
        {
            "Name": "trafficmonitor",
            "Source": "extras",
            "Updated": "2024-08-24T20:33:10.7480549+08:00",
            "Info": "",
            "Version": "1.84.1"
        },
        {
            "Name": "tree-sitter",
            "Source": "main",
            "Updated": "2024-08-24T20:33:13.824655+08:00",
            "Info": "",
            "Version": "0.22.6"
        },
        {
            "Name": "unzip",
            "Source": "main",
            "Updated": "2024-08-24T20:33:15.0974167+08:00",
            "Info": "",
            "Version": "6.00"
        },
        {
            "Name": "ventoy",
            "Source": "extras",
            "Updated": "2024-08-24T20:33:18.5569008+08:00",
            "Info": "",
            "Version": "1.0.99"
        },
        {
            "Name": "vim-tux",
            "Source": "versions",
            "Updated": "2024-08-26T19:43:31.9590381+08:00",
            "Info": "",
            "Version": "9.1.0697_20240826"
        },
        {
            "Name": "vlc",
            "Source": "extras",
            "Updated": "2024-08-24T20:33:46.4354996+08:00",
            "Info": "",
            "Version": "3.0.21"
        },
        {
            "Name": "vscode",
            "Source": "extras",
            "Updated": "2024-08-24T20:34:10.4959874+08:00",
            "Info": "",
            "Version": "1.92.2"
        },
        {
            "Name": "wechat",
            "Source": "extras",
            "Updated": "2024-08-24T20:35:51.4645853+08:00",
            "Info": "",
            "Version": "3.9.11.25"
        },
        {
            "Name": "wget",
            "Source": "main",
            "Updated": "2024-08-24T18:26:55.1230953+08:00",
            "Info": "",
            "Version": "1.21.4"
        },
        {
            "Name": "win32yank",
            "Source": "main",
            "Updated": "2024-08-24T20:35:55.0385436+08:00",
            "Info": "",
            "Version": "0.1.1"
        },
        {
            "Name": "yarn",
            "Source": "main",
            "Updated": "2024-08-24T20:35:58.8225589+08:00",
            "Info": "",
            "Version": "1.22.22"
        },
        {
            "Name": "yazi",
            "Source": "main",
            "Updated": "2024-08-24T20:36:01.47864+08:00",
            "Info": "",
            "Version": "0.3.1"
        },
        {
            "Name": "zed-nightly",
            "Source": "versions",
            "Updated": "2024-08-26T19:39:13.6865446+08:00",
            "Info": "",
            "Version": "20240826"
        },
        {
            "Name": "zig",
            "Source": "main",
            "Updated": "2024-08-24T20:36:39.7001981+08:00",
            "Info": "",
            "Version": "0.13.0"
        },
        {
            "Name": "zls",
            "Source": "main",
            "Updated": "2024-08-24T20:36:42.5227481+08:00",
            "Info": "",
            "Version": "0.13.0"
        },
        {
            "Name": "zstd",
            "Source": "main",
            "Updated": "2024-08-24T20:36:44.9249424+08:00",
            "Info": "",
            "Version": "1.5.6"
        }
    ]
}
